ERP/src/main/Documents/ПерсональныйПромокод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПерсональныйПромокод</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПромокодыПериодДействия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПромокодСтрока</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERP/src/main/Documents/ПерсональныйПромокод/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ПромокодыПериодДействия
	Движения.ПромокодыПериодДействия.Записывать = Истина;
	Движение = Движения.ПромокодыПериодДействия.Добавить();
	Движение.Промокод = Промокод;
	Движение.ПрайсЛист = ПрайсЛист;
	Движение.НачалоДействия = НачалоДействия;
   	Если ЗначениеЗаполнено(КонецДействия) Тогда
		Движение.КонецДействия = КонецДействия;
	Иначе
		Движение.КонецДействия = ГлобальныеКонстанты.ДатаОкончанияВремен();
	КонецЕсли;
	
КонецПроцедуры
